domschl/LugalOS/drivers/emac_esp32p4.c
/* The ESP32-P4's Ethernet MAC: clocks, pads, PHY reset and MDIO.
 * Z1, plan/phase28_esp32p4_ethernet.md.
 *
 * Provenance, because on this chip it is the whole ballgame (the rule is
 * plan/phase27_esp32p4_bringup.md §3.2, and it has already caught two
 * clock-gate bits that plausible reasoning got wrong): every register offset
 * and bit position below was read off the ESP32-P4 TRM's own bit diagrams and
 * cross-checked against ESP-IDF's generated headers under
 * ~/gith/esp/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/. Where a
 * field mattered enough to be worth a second pair of eyes, the TRM register
 * number is named in the comment.
 *
 * What this file is NOT, yet: a netif. The descriptor rings and their cache
 * maintenance are Z2, auto-negotiation is Z3, frames are Z4. Z1 exists to
 * make exactly one claim testable -- that the PHY is there and answers.
 */

#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include <string.h>

#include "kernel/printk.h"
#include "kernel/console.h"
#include "kernel/time.h"
#include "net/netif.h"
#include "drivers/emac_esp32p4.h"
#include "arch/esp32p4_intr.h"
#include "lugalos_config.h"

#define REG(a) (*(volatile uint32_t *)(uintptr_t)(a))

/* --- Peripheral bases (TRM Table 9.3-2, IDF soc/reg_base.h) -------------- */

#define HPPERIPH1_BASE      0x500C0000UL
#define GPIO_BASE           (HPPERIPH1_BASE + 0x20000UL)   /* 0x500E0000 */
#define IOMUX_BASE          (HPPERIPH1_BASE + 0x21000UL)   /* 0x500E1000 */
#define HP_SYS_BASE         (HPPERIPH1_BASE + 0x25000UL)   /* 0x500E5000 */
#define HP_SYS_CLKRST_BASE  (HPPERIPH1_BASE + 0x26000UL)   /* 0x500E6000 */
#define LP_CLKRST_BASE      0x50111000UL                   /* LPAON + 0x1000 */

/* --- Clock and reset -----------------------------------------------------
 *
 * TRM §55.5.1 gives this as an ordered procedure, and two of its properties
 * are the reason this function is shaped the way it is.
 *
 * First, the gates are spread across THREE controllers, not one. The bus
 * clock is in HP_SYS_CLKRST_SOC_CLK_CTRL1; the RMII/RX/TX gates and their
 * source-selects are in HP_SYS_CLKRST_PERI_CLK_CTRL00/01; the pad's own
 * always-on gate and the EMAC's peripheral reset are in LP_CLKRST, a
 * different peripheral in a different power domain. There is no position to
 * infer here and no pattern to follow -- this is the same trap phase 27
 * recorded for the UART, whose two gates are SOC_CLK_CTRL1 bit 18 and
 * SOC_CLK_CTRL2 bit 7.
 *
 * Second, the RX/TX divisors depend on the negotiated line speed, which is
 * not known until auto-negotiation finishes. So this function deliberately
 * does NOT claim to finish the clock setup: it establishes everything that is
 * speed-independent and leaves the divisors at their reset value of 1, which
 * is correct for 100 Mbit/s. Z3 revisits them when the link resolves, and
 * that is a sequencing fact rather than an omission.
 */

#define SOC_CLK_CTRL1       (HP_SYS_CLKRST_BASE + 0x18)
#define  EMAC_SYS_CLK_EN        (1u << 13)   /* TRM Reg 11.7 */

#define PERI_CLK_CTRL00     (HP_SYS_CLKRST_BASE + 0x30)
#define  PAD_EMAC_REF_CLK_EN    (1u << 24)   /* TRM Reg 11.13, confirmed */
#define  EMAC_RMII_CLK_SRC_SEL_S 25          /* [26:25] */
#define  EMAC_RMII_CLK_SRC_SEL_M (3u << EMAC_RMII_CLK_SRC_SEL_S)
#define  EMAC_RMII_CLK_EN       (1u << 27)
#define  EMAC_RX_CLK_SRC_SEL    (1u << 28)
#define  EMAC_RX_CLK_EN         (1u << 29)

#define PERI_CLK_CTRL01     (HP_SYS_CLKRST_BASE + 0x34)
#define  EMAC_RX_CLK_DIV_NUM_M  0xffu        /* [7:0] */
#define  EMAC_TX_CLK_SRC_SEL    (1u << 8)
#define  EMAC_TX_CLK_EN         (1u << 9)
#define  EMAC_TX_CLK_DIV_NUM_S  10           /* [17:10] */
#define  EMAC_TX_CLK_DIV_NUM_M  (0xffu << EMAC_TX_CLK_DIV_NUM_S)

#define REF_CLK_CTRL1       (HP_SYS_CLKRST_BASE + 0x28)
#define  REF_50M_CLK_EN         (1u << 27)

/* LP_CLKRST_HP_CLK_CTRL_REG (0x40): the pad's always-on gate. Its reset value
 * is 1, so this is normally already on -- which is precisely why it is worth
 * writing explicitly rather than relying on it. A gate that is enabled by
 * default is a gate nobody notices until something else clears it. */
#define LP_HP_CLK_CTRL      (LP_CLKRST_BASE + 0x40)
#define  HP_PAD_EMAC_TXRX_CLK_EN (1u << 15)

/* LP_CLKRST_HP_SDMMC_EMAC_RST_CTRL_REG (0x4C), TRM Register 11.70, read off
 * the rendered bit diagram: bit 31 FORCE_NORST_EMAC, bit 30 RST_EN_EMAC,
 * bit 29 FORCE_NORST_SDMMC, bit 28 RST_EN_SDMMC, 27:0 reserved, all reset 0.
 * RST_EN is 1 = hold in reset, 0 = release. */
#define LP_SDMMC_EMAC_RST   (LP_CLKRST_BASE + 0x4c)
#define  RST_EN_EMAC            (1u << 30)
#define  FORCE_NORST_EMAC       (1u << 31)

/* HP_SYSTEM_GMAC_CTRL0_REG (+0x14C): PHY_INTF_SEL is bits [4:2], and 4 selects
 * RMII (TRM §55.5.1). */
#define HP_SYS_GMAC_CTRL0   (HP_SYS_BASE + 0x14c)
#define  PHY_INTF_SEL_S         2
#define  PHY_INTF_SEL_M         (7u << PHY_INTF_SEL_S)
#define  PHY_INTF_RMII          (4u << PHY_INTF_SEL_S)

/* --- The MAC's own registers (TRM chapter 55) --------------------------- */

#define EMAC_BASE           ((uintptr_t)CONFIG_EMAC_BASE)
#define EMAC_GMIIADDR       (EMAC_BASE + 0x10)
#define  GMII_GB                (1u << 0)    /* busy; set to start, self-clears */
#define  GMII_GW                (1u << 1)    /* 1 = write, 0 = read */
#define  GMII_CR_S              2            /* [5:2] CSR clock range */
#define  GMII_GR_S              6            /* [10:6] PHY register */
#define  GMII_PA_S              11           /* [15:11] PHY address */
#define EMAC_GMIIDATA       (EMAC_BASE + 0x14)
#define EMAC_BUSMODE        (EMAC_BASE + 0x1000)
#define  BUSMODE_SWR            (1u << 0)

/* The MDC divider.
 *
 * EMAC_CR selects MDC as a division of the CSR clock, which on this chip is
 * the system clock (IDF emac_ll_get_csr_clk_src(): SOC_MOD_CLK_SYS). This
 * kernel has never configured the P4's clock tree -- phase 27 deliberately
 * drove the console from the crystal so that it would not have to -- so the
 * system clock is whatever the boot ROM left, and this file does not know it.
 *
 * Rather than guess, take the largest divider the field offers: 0b0101 is
 * CSR/124. The asymmetry is what makes this safe rather than lazy. IEEE 802.3
 * caps MDC at 25 MHz, so a divider that is too small breaks the bus, while
 * one that is too large only makes each transaction slower -- at the P4's
 * maximum 400 MHz that is 3.2 MHz, and at the crystal's 40 MHz it is 323 kHz.
 * A scan of 32 addresses costs microseconds either way.
 *
 * Z3 may revisit this once something in this tree knows the system clock.
 * Until then the conservative choice is the honest one. */
#define GMII_CR_CSR_DIV_124     (5u << GMII_CR_S)

/* --- IO_MUX and the GPIO matrix (TRM chapter 10) ------------------------
 *
 * The per-pad IO_MUX register is IOMUX_BASE + 0x4 + 4*n, confirmed on this
 * silicon by E1's GPIO20 toggle before it was ever used here. MCU_SEL picks
 * which peripheral owns the pad; every EMAC RMII pad is function 3, and
 * function 1 is plain GPIO / matrix (IDF's PIN_FUNC_GPIO). */
#define IOMUX_PAD(n)        (IOMUX_BASE + 0x4 + 4u * (uint32_t)(n))
#define  IOMUX_MCU_SEL_S        12
#define  IOMUX_MCU_SEL_M        (7u << IOMUX_MCU_SEL_S)
#define  IOMUX_FUN_IE           (1u << 9)
#define  IOMUX_FUN_PU           (1u << 8)
#define  IOMUX_FUN_DRV_S        10           /* [11:10] */
#define  IOMUX_FUN_DRV_M        (3u << IOMUX_FUN_DRV_S)
#define  IOMUX_FUNC_GPIO        1u
#define  IOMUX_FUNC_EMAC        3u

/* Per-pad output routing: which signal drives this pad. 256 means "plain
 * GPIO", which is the reset value. */
#define GPIO_OUT_SEL(n)     (GPIO_BASE + 0x558 + 4u * (uint32_t)(n))
#define  GPIO_OUT_SEL_GPIO      256u
/* Per-SIGNAL input routing: which pad feeds this peripheral input. Bit 7
 * ("do not bypass GPIO") must be set for the matrix to be used at all --
 * clearing it bypasses the matrix, which is the default and is not what a
 * matrix-routed signal wants. */
#define GPIO_IN_SEL(sig)    (GPIO_BASE + 0x158 + 4u * (uint32_t)(sig))
#define  GPIO_IN_SEL_ROUTE      (1u << 7)

/* The P4 has 57 GPIOs, so every "one bit per pin" register is TWO registers:
 * a low word for pins 0..31 and a high word for 32..56. This board puts four
 * EMAC signals above the split (TX_EN 49, RMII_CLK 50, PHY reset 51, MDIO 52)
 * and MDC at 31, right on the boundary -- so a helper that forgets the high
 * bank is wrong for most of this driver and correct for exactly the pin a
 * casual test would try first.
 *
 * The compiler caught one instance of this (a constant `1u << 51` overflowed
 * and warned); it could not catch the ones behind a runtime pin number, which
 * would have shifted by 52 and quietly written bit 20 of the low word. Hence
 * accessors rather than macros, used everywhere. */
#define GPIO_OUT_W1TS_LO    (GPIO_BASE + 0x8)
#define GPIO_OUT_W1TC_LO    (GPIO_BASE + 0xc)
#define GPIO_OUT_W1TS_HI    (GPIO_BASE + 0x14)
#define GPIO_OUT_W1TC_HI    (GPIO_BASE + 0x18)
#define GPIO_ENABLE_W1TS_LO (GPIO_BASE + 0x24)
#define GPIO_ENABLE_W1TS_HI (GPIO_BASE + 0x30)

/* Sets the pin's bit in whichever half of a paired register it belongs to.
 * `lo`/`hi` are the two register addresses; the caller names the pair. */
static void gpio_bit_set(uintptr_t lo, uintptr_t hi, uint32_t gpio) {
    if (gpio < 32u) REG(lo) = (1u << gpio);
    else            REG(hi) = (1u << (gpio - 32u));
}

/* GPIO-matrix signal indices, IDF soc/gpio_sig_map.h. MDIO is bidirectional,
 * so its pad carries two of them: MDO out and MDI in. */
#define SIG_MII_MDI_IN      107u
#define SIG_MII_MDC_OUT     108u
#define SIG_MII_MDO_OUT     109u

/* --- small helpers ------------------------------------------------------ */

static void reg_modify(uintptr_t addr, uint32_t clear, uint32_t set) {
    uint32_t v = REG(addr);
    v &= ~clear;
    v |= set;
    REG(addr) = v;
}

/* Puts a pad on an IO_MUX function directly (no matrix). `ie` requests the
 * input buffer, which every RMII receive signal and the RMII clock need. */
static void pad_iomux(uint32_t gpio, uint32_t func, bool ie) {
    uint32_t v = REG(IOMUX_PAD(gpio));
    v &= ~(IOMUX_MCU_SEL_M | IOMUX_FUN_IE | IOMUX_FUN_DRV_M);
    v |= (func << IOMUX_MCU_SEL_S);
    v |= (3u << IOMUX_FUN_DRV_S);   /* strongest drive; RMII runs at 50 MHz */
    if (ie) v |= IOMUX_FUN_IE;
    REG(IOMUX_PAD(gpio)) = v;
}

/* Routes a peripheral output signal onto a pad through the matrix. */
static void matrix_out(uint32_t gpio, uint32_t sig) {
    pad_iomux(gpio, IOMUX_FUNC_GPIO, false);
    REG(GPIO_OUT_SEL(gpio)) = sig;
    gpio_bit_set(GPIO_ENABLE_W1TS_LO, GPIO_ENABLE_W1TS_HI, gpio);
}

/* Routes a pad into a peripheral input signal through the matrix. */
static void matrix_in(uint32_t gpio, uint32_t sig) {
    reg_modify(IOMUX_PAD(gpio), 0, IOMUX_FUN_IE);
    REG(GPIO_IN_SEL(sig)) = GPIO_IN_SEL_ROUTE | (gpio & 0x3fu);
}

