domschl/LugalOS/drivers/emac_esp32p4.c
/* A plain push-pull GPIO output, for the PHY's reset line. */
static void gpio_output(uint32_t gpio, bool level) {
    pad_iomux(gpio, IOMUX_FUNC_GPIO, false);
    REG(GPIO_OUT_SEL(gpio)) = GPIO_OUT_SEL_GPIO;
    if (level) gpio_bit_set(GPIO_OUT_W1TS_LO, GPIO_OUT_W1TS_HI, gpio);
    else       gpio_bit_set(GPIO_OUT_W1TC_LO, GPIO_OUT_W1TC_HI, gpio);
    gpio_bit_set(GPIO_ENABLE_W1TS_LO, GPIO_ENABLE_W1TS_HI, gpio);
}

/* --- bring-up ----------------------------------------------------------- */

static void emac_clocks_on(void) {
    /* 1. The bus clock. Without it the EMAC's registers do not even decode. */
    reg_modify(SOC_CLK_CTRL1, 0, EMAC_SYS_CLK_EN);

    /* 2. Release the peripheral from reset. RST_EN is 1 = hold, 0 = release;
     *    both it and FORCE_NORST reset to 0, so this is normally a no-op, and
     *    is written anyway so that a second emac_probe() after a failed one
     *    starts from a known state. */
    reg_modify(LP_SDMMC_EMAC_RST, RST_EN_EMAC | FORCE_NORST_EMAC, 0);

    /* 3. RMII, not MII. */
    reg_modify(HP_SYS_GMAC_CTRL0, PHY_INTF_SEL_M, PHY_INTF_RMII);

    /* 4. The reference clock comes FROM the PHY on this board (its own 25 MHz
     *    crystal, 50 MHz out of M_CLKO), so the P4 must not drive a clock onto
     *    that pad. TRM §55.5.1's "reference clock sourced from the external
     *    crystal" branch: disable PAD_EMAC_REF_CLK and PLL_F50M. Driving both
     *    ends of a clock net is not a subtle failure, but it is an avoidable
     *    one. */
    reg_modify(PERI_CLK_CTRL00, PAD_EMAC_REF_CLK_EN, 0);
    reg_modify(REF_CLK_CTRL1, REF_50M_CLK_EN, 0);

    /* 5. The pad's always-on gate, in the LP domain. Reset value is 1. */
    reg_modify(LP_HP_CLK_CTRL, 0, HP_PAD_EMAC_TXRX_CLK_EN);

    /* 6. Source RMII/RX/TX from the pad, and enable the three gates. Source
     *    select 0 is PAD_EMAC_TXRX_CLK for all three (TRM §55.5.1's RMII
     *    branch names PAD_EMAC_TXRX_CLK as the source in each case), which is
     *    also their reset value -- written explicitly for the same reason as
     *    step 2.
     *
     *    The divisors are left at their reset value of 1: correct for
     *    100 Mbit/s, and revisited by Z3 when auto-negotiation says what the
     *    line speed actually is. */
    reg_modify(PERI_CLK_CTRL00,
               EMAC_RMII_CLK_SRC_SEL_M | EMAC_RX_CLK_SRC_SEL,
               EMAC_RMII_CLK_EN | EMAC_RX_CLK_EN);
    reg_modify(PERI_CLK_CTRL01, EMAC_TX_CLK_SRC_SEL, EMAC_TX_CLK_EN);
}

static void emac_pads(void) {
    /* RMII data and clock: IO_MUX function 3, direct, no matrix. Inputs need
     * the input buffer; outputs do not. The board file explains at length why
     * these particular numbers are not interchangeable. */
    pad_iomux(CONFIG_EMAC_RMII_CLK_GPIO, IOMUX_FUNC_EMAC, true);
    pad_iomux(CONFIG_EMAC_CRS_DV_GPIO,   IOMUX_FUNC_EMAC, true);
    pad_iomux(CONFIG_EMAC_RXD0_GPIO,     IOMUX_FUNC_EMAC, true);
    pad_iomux(CONFIG_EMAC_RXD1_GPIO,     IOMUX_FUNC_EMAC, true);
    pad_iomux(CONFIG_EMAC_TX_EN_GPIO,    IOMUX_FUNC_EMAC, false);
    pad_iomux(CONFIG_EMAC_TXD0_GPIO,     IOMUX_FUNC_EMAC, false);
    pad_iomux(CONFIG_EMAC_TXD1_GPIO,     IOMUX_FUNC_EMAC, false);

    /* Station management goes through the GPIO matrix, because MDC and MDIO
     * have no IO_MUX pad of their own on this chip. MDIO is bidirectional and
     * therefore carries both directions on one pad. */
    matrix_out(CONFIG_EMAC_MDC_GPIO,  SIG_MII_MDC_OUT);
    matrix_out(CONFIG_EMAC_MDIO_GPIO, SIG_MII_MDO_OUT);
    matrix_in(CONFIG_EMAC_MDIO_GPIO,  SIG_MII_MDI_IN);
    /* MDIO idles high and is driven by both ends; the pull-up matters when
     * neither is driving. */
    reg_modify(IOMUX_PAD(CONFIG_EMAC_MDIO_GPIO), 0, IOMUX_FUN_PU);
}

/* The IP101GRI's reset is active low. Held low, then released, then given
 * time before MDIO is attempted -- the part needs the reference clock stable
 * and its own internal reset to finish before it will answer. The figures
 * here are generous rather than calibrated: this runs once at bring-up, and
 * the cost of being slow is nothing while the cost of being early is a scan
 * that finds nothing and sends the reader looking for a wiring fault. */
static void phy_reset(void) {
    gpio_output(CONFIG_EMAC_PHY_RST_GPIO, false);
    time_delay_us(20000);
    gpio_bit_set(GPIO_OUT_W1TS_LO, GPIO_OUT_W1TS_HI, CONFIG_EMAC_PHY_RST_GPIO);
    time_delay_us(100000);
}

int emac_probe(void) {
    emac_clocks_on();
    emac_pads();
    phy_reset();

    /* The MAC's software reset.
     *
     * This is the step that will fail if anything earlier is wrong, and it
     * fails in a specific and useful way. The DWC_EMAC's own register
     * description says it outright: "The reset operation is completed only
     * when all resets in all active clock domains are deasserted Therefore,
     * it is essential that all PHY inputs clocks (applicable for the selected
     * PHY interface) are present for the software reset completion."
     *
     * In other words SWR does not clear until the PHY is supplying the 50 MHz
     * RMII reference. That is why phy_reset() runs BEFORE this and not after,
     * and it makes this bit an excellent single test of the whole clock and
     * pad configuration: if it clears, the reference clock is arriving.
     *
     * Bounded, and the bound is the diagnosis. */
    REG(EMAC_BUSMODE) |= BUSMODE_SWR;
    for (unsigned i = 0; i < 100000u; i++) {
        if ((REG(EMAC_BUSMODE) & BUSMODE_SWR) == 0) {
            return 0;
        }
    }
    return -1;
}

/* --- station management ------------------------------------------------- */

static int mdio_wait_idle(void) {
    for (unsigned i = 0; i < 100000u; i++) {
        if ((REG(EMAC_GMIIADDR) & GMII_GB) == 0) return 0;
    }
    return -1;
}

int emac_mdio_read(uint8_t phy_addr, uint8_t reg) {
    if (mdio_wait_idle() != 0) return -1;
    REG(EMAC_GMIIADDR) =
        ((uint32_t)(phy_addr & 0x1fu) << GMII_PA_S) |
        ((uint32_t)(reg & 0x1fu) << GMII_GR_S) |
        GMII_CR_CSR_DIV_124 | GMII_GB;
    if (mdio_wait_idle() != 0) return -1;
    return (int)(REG(EMAC_GMIIDATA) & 0xffffu);
}

int emac_mdio_write(uint8_t phy_addr, uint8_t reg, uint16_t val) {
    if (mdio_wait_idle() != 0) return -1;
    REG(EMAC_GMIIDATA) = val;
    REG(EMAC_GMIIADDR) =
        ((uint32_t)(phy_addr & 0x1fu) << GMII_PA_S) |
        ((uint32_t)(reg & 0x1fu) << GMII_GR_S) |
        GMII_CR_CSR_DIV_124 | GMII_GW | GMII_GB;
    return mdio_wait_idle();
}

