domschl/LugalOS/drivers/emac_esp32p4.c
/* --- the scan ------------------------------------------------------------
 *
 * Clause 22 register 2 is PHYIDR1 and register 3 is PHYIDR2; together they
 * carry the OUI and the vendor's model and revision. An address with nothing
 * on it reads back 0xFFFF (MDIO idles high and nobody drove it low) or
 * 0x0000; anything else is a part.
 *
 * This is a table a human asked for, so it goes to the console with cprintf()
 * rather than into the kernel log -- the same call i2c_scan_bus() makes, for
 * the same reason. */
void emac_phy_scan(void) {
    int rc = emac_probe();
    if (rc != 0) {
        /* The diagnosis, kept here rather than printed: SWR cannot clear
         * until the PHY supplies the 50 MHz RMII reference, so this means the
         * reference clock (CONFIG_EMAC_RMII_CLK_GPIO), the PHY's reset line
         * (CONFIG_EMAC_PHY_RST_GPIO), or one of the clock gates -- and not
         * MDIO, which has not been attempted yet. Every runtime string on
         * this board is RAM-resident (linker/esp32p4.ld), so prose lives in
         * the source and the message carries the facts. */
        cprintf("[EMAC] probe failed (%d): MAC reset never completed; "
                "no RMII reference clock?\n", rc);
        return;
    }

    cprintf("EMAC at 0x%lx, MDIO on MDC=GPIO%d MDIO=GPIO%d. Scanning 0..31:\n",
            (unsigned long)EMAC_BASE, CONFIG_EMAC_MDC_GPIO,
            CONFIG_EMAC_MDIO_GPIO);

    unsigned found = 0;
    bool seen_expected = false;
    for (uint8_t a = 0; a < 32; a++) {
        int id1 = emac_mdio_read(a, 2);
        int id2 = emac_mdio_read(a, 3);
        if (id1 < 0 || id2 < 0) {
            cprintf("  %2u: MDIO stayed busy\n", (unsigned)a);
            continue;
        }
        if ((id1 == 0xffff && id2 == 0xffff) || (id1 == 0 && id2 == 0)) continue;
        /* Clause 22: PHYIDR1 carries OUI bits 3..18, PHYIDR2 carries OUI
         * bits 19..24 in [15:10], the vendor's model in [9:4] and the
         * revision in [3:0]. Reassembling the OUI is worth the three lines --
         * it turns "some part answered" into a manufacturer a reader can look
         * up. Printed raw as well as decoded, because the raw pair is what
         * compares against a datasheet. */
        uint32_t oui = ((uint32_t)id1 << 6) | (((uint32_t)id2 >> 10) & 0x3fu);
        cprintf("  %2u: ID 0x%04x/0x%04x OUI %02x-%02x-%02x model %u rev %u\n",
                (unsigned)a, (unsigned)id1, (unsigned)id2,
                (unsigned)((oui >> 16) & 0xffu), (unsigned)((oui >> 8) & 0xffu),
                (unsigned)(oui & 0xffu),
                (unsigned)((id2 >> 4) & 0x3f), (unsigned)(id2 & 0xf));
        found++;
        if (a == (uint8_t)CONFIG_EMAC_PHY_ADDR) {
            seen_expected = true;
            if (id1 != CONFIG_EMAC_PHY_ID1 || id2 != CONFIG_EMAC_PHY_ID2) {
                cprintf("      ^ WRONG PART: board file says 0x%04x/0x%04x\n",
                        (unsigned)CONFIG_EMAC_PHY_ID1,
                        (unsigned)CONFIG_EMAC_PHY_ID2);
            }
        }
    }

    /* The board file's CONFIG_EMAC_PHY_ADDR was measured here in Z1. Saying
     * so on every run is what keeps it a claim instead of a comment: a
     * swapped board, a re-strapped PHY or a dead part all show up as a
     * disagreement rather than as a mysterious failure three milestones
     * later. */
    if (found == 0) {
        /* The MAC reset completed, so the reference clock is arriving; that
         * leaves MDC/MDIO routing or the PHY's address straps. */
        cprintf("  nothing answered (clock is fine; suspect MDC/MDIO or straps)\n");
    } else if (!seen_expected) {
        cprintf("  %u PHY%s responded, but NOT at %d where the board file "
                "says it should be.\n",
                found, found == 1 ? "" : "s", (int)CONFIG_EMAC_PHY_ADDR);
    } else if (found == 1) {
        cprintf("  1 PHY at %d, as the board file says. OK.\n",
                (int)CONFIG_EMAC_PHY_ADDR);
    } else {
        cprintf("  %u PHYs incl. the expected one at %d (more than one is "
                "unexpected here)\n", found, (int)CONFIG_EMAC_PHY_ADDR);
    }
}

/* ======================================================================
 * Z2 -- descriptor rings, cache maintenance, and MAC internal loopback.
 * ====================================================================== */

/* --- The descriptors ----------------------------------------------------
 *
 * The DWC_EMAC's "enhanced" descriptor is 32 bytes: two status/control words,
 * a buffer pointer, a second pointer, and four words of timestamp and
 * reserved space. That is the layout the hardware reads.
 *
 * They are declared as 64 bytes here anyway, and the padding is load-bearing.
 * The CPU and the DMA both write these words -- the CPU sets up a descriptor
 * and hands it over, the DMA writes status back -- so every descriptor needs
 * cache maintenance, and an invalidate discards a whole 64-byte line. If two
 * 32-byte descriptors shared a line, invalidating one to read its status
 * would throw away the neighbour's setup. One descriptor per line makes that
 * impossible rather than merely unlikely. (ESP-IDF pads to 64 on this chip
 * for the same reason, commented only as "due to cache arrangement".)
 *
 * Because the descriptors are 64 bytes and the DMA expects 32, the ring is
 * built in CHAINED mode rather than ring mode: each descriptor's second
 * pointer holds the address of its successor and the last points back at the
 * first, so the DMA never computes a stride and the padding costs nothing but
 * memory. The alternative -- ring mode with DESC_SKIP_LEN set to 8 words --
 * would work too, and is one more number to get wrong.
 */

typedef struct {
    volatile uint32_t des0;     /* status + control; bit 31 is OWN */
    volatile uint32_t des1;     /* buffer sizes and flags */
    volatile uint32_t buf;      /* buffer 1 address */
    volatile uint32_t next;     /* chained mode: address of the next descriptor */
    volatile uint32_t ext;      /* RDES4 extended status; unused in TX */
    volatile uint32_t rsvd;
    volatile uint32_t ts_lo;    /* IEEE 1588 timestamp -- phase 29, not read here */
    volatile uint32_t ts_hi;
    uint8_t pad[ESP32P4_L1_CACHE_LINE - 32];
} emac_desc_t;

_Static_assert(sizeof(emac_desc_t) == ESP32P4_L1_CACHE_LINE,
               "a descriptor must occupy exactly one cache line");

/* TDES0 */
#define TDES0_OWN           (1u << 31)
#define TDES0_IC            (1u << 30)  /* interrupt on completion */
#define TDES0_LS            (1u << 29)  /* last segment */
#define TDES0_FS            (1u << 28)  /* first segment */
#define TDES0_TCH           (1u << 20)  /* second address chained */
#define TDES0_ES            (1u << 15)  /* error summary */
/* TDES1 */
#define TDES1_TBS1_M        0x1fffu     /* buffer 1 size, [12:0] */

/* RDES0 */
#define RDES0_OWN           (1u << 31)
#define RDES0_ES            (1u << 15)  /* error summary */
#define RDES0_FL_S          16          /* frame length, [29:16] */
#define RDES0_FL_M          0x3fffu
#define RDES0_LS            (1u << 8)   /* last descriptor */
#define RDES0_FS            (1u << 9)   /* first descriptor */
/* RDES1 */
#define RDES1_RCH           (1u << 14)  /* second address chained */
#define RDES1_RBS1_M        0x1fffu

