domschl/LugalOS/drivers/emac_esp32p4.c
/* --- Ring storage -------------------------------------------------------
 *
 * Static .bss, like every other allocation on this path -- net/netif.h's
 * contract is explicit that a driver owns its storage and that there is no
 * allocation here.
 *
 * Sizes, and what they cost. On this board .bss and the heap come out of the
 * same 384 KB (linker/esp32p4.ld), so every byte here is a byte palloc does
 * not get -- the same trade the RP2350 board file describes:
 *
 *     4 RX descriptors + 2 TX descriptors   6 * 64  =    384 B
 *     4 RX buffers + 2 TX buffers           6 * 1536 = 9216 B
 *                                                     ------
 *                                                      9600 B  (9.4 KB)
 *
 * Four RX and two TX is small on purpose: Z2 proves the mechanism, and a
 * deeper ring proves nothing more while costing the heap. Z4 revisits the
 * depth against real traffic rather than against a guess.
 *
 * 1536 is 24 whole cache lines and comfortably over NETIF_FRAME_MAX (1514).
 * Being a multiple of the line size is the point: it means a buffer never
 * shares a cache line with the next buffer, so invalidating one after the DMA
 * has written it cannot discard part of another.
 */
#define EMAC_RX_DESC_COUNT  4u
#define EMAC_TX_DESC_COUNT  2u
#define EMAC_BUF_SIZE       1536u

_Static_assert(EMAC_BUF_SIZE % ESP32P4_L1_CACHE_LINE == 0,
               "a DMA buffer must be a whole number of cache lines, or "
               "invalidating one will discard part of its neighbour");

#define CACHE_ALIGNED __attribute__((aligned(ESP32P4_L1_CACHE_LINE)))

static CACHE_ALIGNED emac_desc_t g_rx_desc[EMAC_RX_DESC_COUNT];
static CACHE_ALIGNED emac_desc_t g_tx_desc[EMAC_TX_DESC_COUNT];
static CACHE_ALIGNED uint8_t     g_rx_buf[EMAC_RX_DESC_COUNT][EMAC_BUF_SIZE];
static CACHE_ALIGNED uint8_t     g_tx_buf[EMAC_TX_DESC_COUNT][EMAC_BUF_SIZE];

static uint32_t g_rx_next;   /* the descriptor we will look at next */
static uint32_t g_tx_next;

/* --- DMA and MAC registers beyond the ones Z1 needed ------------------- */

#define EMAC_MACCONFIG      (EMAC_BASE + 0x0000)
#define  MACCFG_RE              (1u << 2)
#define  MACCFG_TE              (1u << 3)
#define  MACCFG_ACS             (1u << 7)   /* strip pad/CRC on receive */
#define  MACCFG_DM              (1u << 11)  /* full duplex */
#define  MACCFG_LM              (1u << 12)  /* MAC internal loopback */
#define  MACCFG_FES             (1u << 14)  /* 1 = 100 Mbit/s */
#define  MACCFG_PS              (1u << 15)  /* port select: MII/RMII 10-100 */
#define  MACCFG_JD              (1u << 22)  /* jabber disable */
#define  MACCFG_WD              (1u << 23)  /* watchdog disable */
#define EMAC_MACFRAMEFILTER (EMAC_BASE + 0x0004)
#define  FILTER_PR              (1u << 0)   /* promiscuous */
#define  FILTER_PM              (1u << 4)   /* pass all multicast */
#define  FILTER_DBF             (1u << 5)   /* 1 = BLOCK broadcast; note the sense */
#define  FILTER_RA              (1u << 31)  /* receive all, filter nothing */

/* The station address the receive filter matches against (Z4). Offsets and
 * byte order from IDF's emac_ll_set_addr() and the generated
 * soc/emac_reg.h, not from inference -- getting the halves backwards would
 * produce a filter that silently matches nothing.
 *
 * LOW holds bytes 0..3 little-endian; HIGH's low 16 bits hold bytes 4 and 5.
 * HIGH bit 31 (AE, "address enable") is documented read-only and always 1 on
 * this core, so address 0 cannot be disabled and nothing needs to set it. */
#define EMAC_MACADDR0HIGH   (EMAC_BASE + 0x0040)
#define EMAC_MACADDR0LOW    (EMAC_BASE + 0x0044)

/* Note the order: RX base comes BEFORE TX base. Swapping them is an easy
 * mistake with a confusing symptom (the DMA walks the wrong list and nothing
 * is ever owned), so they are named rather than computed. */
#define EMAC_DMA_TXPOLL     (EMAC_BASE + 0x1004)
#define EMAC_DMA_RXPOLL     (EMAC_BASE + 0x1008)
#define EMAC_DMA_RXBASE     (EMAC_BASE + 0x100c)
#define EMAC_DMA_TXBASE     (EMAC_BASE + 0x1010)
#define EMAC_DMA_STATUS     (EMAC_BASE + 0x1014)
/* Frames the controller itself threw away: bits 15:0 count "no descriptor was
 * free", bit 16 is that counter's overflow, bits 27:17 count frames lost to
 * the receive FIFO overflowing. The distinction matters when frames go
 * missing -- a DA-filter reject is invisible here, so a zero in this register
 * alongside frames that never arrived means they were filtered out, not
 * dropped for want of a buffer. */
#define EMAC_DMA_MISSEDFRAME (EMAC_BASE + 0x1020)
#define EMAC_DMA_OPMODE     (EMAC_BASE + 0x1018)
#define  OPMODE_SR              (1u << 1)   /* start receive */
#define  OPMODE_ST              (1u << 13)  /* start transmit */
#define  OPMODE_FTF             (1u << 20)  /* flush TX FIFO (self-clearing) */
#define  OPMODE_TSF             (1u << 21)  /* transmit store-and-forward */
#define  OPMODE_RSF             (1u << 25)  /* receive store-and-forward */
/* Threshold fields, used because store-and-forward is not available here:
 * RTC is [4:3] and TTC is [16:14], and zero in both means a 64-byte
 * threshold, which is what this driver wants. Named so the zeroes below are
 * visibly deliberate rather than merely absent. */
#define  OPMODE_RTC_64          (0u << 3)
#define  OPMODE_TTC_64          (0u << 14)

/* BUSMODE bits beyond SWR */
#define  BUSMODE_ATDS           (1u << 7)   /* 32-byte (enhanced) descriptors */
#define  BUSMODE_PBL_S          8
#define  BUSMODE_FB             (1u << 16)  /* fixed burst */
#define  BUSMODE_AAL            (1u << 25)  /* address-aligned beats */
#define  BUSMODE_MB             (1u << 26)  /* mixed burst */

/* --- cache helpers, named for what they mean ---------------------------- */

/* These are proven load-bearing, not defensive.
 *
 * Z2 measured it: with both primitives stubbed out to no-ops and nothing else
 * changed, the loopback test does not merely lose a frame occasionally, it
 * fails completely and immediately --
 *
 *     60 B: nothing came back (0), DMA status 0x00680084
 *     64 B: nothing came back (0), DMA status 0x00680084
 *     65 B: send refused (-2)      <- and every size after it
 *
 * `-2` is emac_tx() finding OWN still set. The DMA had cleared it in memory;
 * the CPU was reading a stale cache line. That is the whole hazard in one
 * observation, and it is why this driver cannot be written the way the
 * ENC28J60 and CYW43 drivers are.
 *
 * The experiment is two lines if it ever needs repeating: #define both of
 * these away at the top of this file and run `emac loopback`. */
static void desc_to_dma(emac_desc_t *d) {
    esp32p4_dcache_writeback((uintptr_t)d, sizeof(*d));
}
static void desc_from_dma(emac_desc_t *d) {
    esp32p4_dcache_invalidate((uintptr_t)d, sizeof(*d));
}

/* --- ring construction --------------------------------------------------- */

static void emac_rings_init(void) {
    for (uint32_t i = 0; i < EMAC_RX_DESC_COUNT; i++) {
        emac_desc_t *d = &g_rx_desc[i];
        d->des1 = RDES1_RCH | (EMAC_BUF_SIZE & RDES1_RBS1_M);
        d->buf  = (uint32_t)(uintptr_t)g_rx_buf[i];
        d->next = (uint32_t)(uintptr_t)&g_rx_desc[(i + 1u) % EMAC_RX_DESC_COUNT];
        d->ext = d->rsvd = d->ts_lo = d->ts_hi = 0;
        /* The buffer is about to belong to the DMA, and the CPU may have
         * dirty lines over it from a previous frame. Invalidate rather than
         * write back: whatever is there is stale by definition, and writing
         * it back would be a pointless bus transaction that could also race
         * the DMA's own write. */
        esp32p4_dcache_invalidate((uintptr_t)g_rx_buf[i], EMAC_BUF_SIZE);
        /* OWN last, then push the whole descriptor out. The order is the
         * point: the DMA must never see OWN set over a half-built
         * descriptor. */
        d->des0 = RDES0_OWN;
        desc_to_dma(d);
    }
    for (uint32_t i = 0; i < EMAC_TX_DESC_COUNT; i++) {
        emac_desc_t *d = &g_tx_desc[i];
        d->des0 = TDES0_TCH;            /* chained; not owned by the DMA yet */
        d->des1 = 0;
        d->buf  = (uint32_t)(uintptr_t)g_tx_buf[i];
        d->next = (uint32_t)(uintptr_t)&g_tx_desc[(i + 1u) % EMAC_TX_DESC_COUNT];
        d->ext = d->rsvd = d->ts_lo = d->ts_hi = 0;
        desc_to_dma(d);
    }
    g_rx_next = 0;
    g_tx_next = 0;

