domschl/LugalOS/drivers/emac_esp32p4.c
    REG(EMAC_DMA_RXBASE) = (uint32_t)(uintptr_t)g_rx_desc;
    REG(EMAC_DMA_TXBASE) = (uint32_t)(uintptr_t)g_tx_desc;
}

/* Defined with the netif, further down: drops any half-received frame and
 * held by the netif, whose descriptor the DMA has just taken back. */
static void emac_netif_restarted(void);

/* Brings the DMA and MAC up. `loopback` selects the MAC's internal loopback,
 * which is what lets Z2 prove the rings with no PHY and no cable in the
 * picture -- one candidate cause per failure, which is phase 27 §0's rule. */
static void emac_start(bool loopback) {
    /* Enhanced (32-byte) descriptors, mixed and fixed bursts, aligned beats,
     * burst length 32. */
    reg_modify(EMAC_BUSMODE, (0x3fu << BUSMODE_PBL_S),
               BUSMODE_ATDS | BUSMODE_FB | BUSMODE_AAL | BUSMODE_MB |
               (32u << BUSMODE_PBL_S));

    emac_rings_init();

    /* Threshold mode, NOT store-and-forward, and this is not a preference.
     *
     * Z2's first run failed every frame of 512 bytes and up with the DMA
     * status reporting receive overflow (bit 4), because store-and-forward
     * holds a whole frame in the MTL FIFO before releasing it and **this
     * chip's receive FIFO is 256 bytes**. A 512-byte frame cannot fit, so it
     * overflows and is dropped. ESP-IDF disables RSF for every target except
     * the original ESP32, with the one-line reason "Rx FIFO is only 256B".
     *
     * In threshold mode the DMA starts moving bytes out once 64 are buffered,
     * so frame size stops being bounded by the FIFO. "One descriptor, one
     * frame" still holds -- that is a property of the buffer being large
     * enough, not of store-and-forward.
     *
     * Flush the TX FIFO first; the bit self-clears. */
    REG(EMAC_DMA_OPMODE) = OPMODE_FTF;
    for (unsigned i = 0; i < 10000u && (REG(EMAC_DMA_OPMODE) & OPMODE_FTF); i++) {
        /* spin */
    }
    REG(EMAC_DMA_OPMODE) = OPMODE_RTC_64 | OPMODE_TTC_64;

    /* 100 Mbit/s full duplex, MII/RMII port, jabber and watchdog off (they
     * police frame sizes this driver deliberately walks up to).
     *
     * ACS -- automatic pad/CRC stripping -- is deliberately NOT set, and the
     * reason is worth stating because setting it looks like exactly what
     * net/netif.h wants ("no FCS ... both check and strip it"). The DWC_EMAC
     * strips only when the length/type field is **less than 1536**, i.e. only
     * for 802.3 length-framed packets. Every Ethernet II frame -- which is all
     * of them here, IPv4 is type 0x0800 = 2048 -- is above that, so ACS would
     * do nothing for real traffic while appearing to solve the problem.
     *
     * So the FCS is stripped in software instead, unconditionally, in
     * emac_rx(). Z2's first run showed this as every frame coming back
     * exactly four bytes long. */
    uint32_t cfg = MACCFG_PS | MACCFG_FES | MACCFG_DM |
                   MACCFG_JD | MACCFG_WD;
    if (loopback) cfg |= MACCFG_LM;
    REG(EMAC_MACCONFIG) = cfg;

    /* In loopback, filter nothing: the destination address is whatever the Z2
     * test wrote, and refusing frames there would mean debugging the filter
     * instead of the rings.
     *
     * On the wire (Z4), a filter register of **zero** is exactly what this
     * driver wants, which is worth spelling out because "0" reads like "not
     * configured yet":
     *
     *   PR  = 0  not promiscuous
     *   HUC = 0  unicast destinations are matched *perfectly* against
     *            Address0 -- the address emac_set_mac() programmed -- rather
     *            than through the hash table
     *   PM  = 0  and HMC = 0, so multicast is dropped
     *   DBF = 0  broadcast passes. The sense is inverted: the bit *disables*
     *            broadcast, so leaving it clear is what lets ARP work
     *   PCF = 00 MAC control frames (pause) are handled by the MAC and never
     *            reach us, which is what we want with flow control off
     *
     * That is precisely phase 28 Z4's requirement -- our unicast plus
     * broadcast -- with the hardware doing the comparison instead of a
     * memcmp() on every arriving frame. */
    REG(EMAC_MACFRAMEFILTER) = loopback ? FILTER_RA : 0u;

    REG(EMAC_MACCONFIG) = cfg | MACCFG_TE | MACCFG_RE;
    REG(EMAC_DMA_OPMODE) |= OPMODE_ST | OPMODE_SR;

    /* The rings were just reinitialised, so any descriptor the netif was
     * holding is now owned by the DMA again -- forget it rather than hand its
     * buffer up later. */
    emac_netif_restarted();
}

/* --- one frame out ------------------------------------------------------ */

/* Returns the buffer the next transmit will send from, or NULL if the DMA
 * still owns that descriptor. Fill it, then call emac_tx_submit().
 *
 * Split out from emac_tx() so a caller that generates its payload (the
 * loopback selftest) can write straight into the DMA buffer instead of
 * building it somewhere else and having it copied. That removes 3 KB of .bss
 * -- which on this board is 3 KB the heap gets to keep -- and it makes the
 * selftest stronger, because a test with no second copy of the data cannot
 * accidentally compare a buffer against itself. */
static uint8_t *emac_tx_buffer(void) {
    emac_desc_t *d = &g_tx_desc[g_tx_next];
    desc_from_dma(d);
    if (d->des0 & TDES0_OWN) return NULL;
    return g_tx_buf[g_tx_next];
}

static int emac_tx_submit(uint32_t len) {
    if (len == 0 || len > EMAC_BUF_SIZE) return -1;
    emac_desc_t *d = &g_tx_desc[g_tx_next];

    /* The CPU just wrote the buffer; push it to memory before the DMA reads
     * it. This is the half that is easy to forget and whose absence looks
     * like corrupted frames rather than like a cache bug. */
    esp32p4_dcache_writeback((uintptr_t)g_tx_buf[g_tx_next], len);

    d->des1 = len & TDES1_TBS1_M;
    d->des0 = TDES0_TCH | TDES0_FS | TDES0_LS | TDES0_IC | TDES0_OWN;
    desc_to_dma(d);

    g_tx_next = (g_tx_next + 1u) % EMAC_TX_DESC_COUNT;

    /* Tell the DMA to look again; it may have suspended on an unowned
     * descriptor. Any value will do -- the register is a doorbell. */
    REG(EMAC_DMA_TXPOLL) = 1;
    return 0;
}


/* --- one frame in ------------------------------------------------------- */

