domschl/LugalOS/drivers/emac_esp32p4.c
/* Returns a pointer to the buffer holding the next received frame and its
 * length in *len, or NULL if none is ready or it errored. The caller must
 * call emac_rx_release() when done with the bytes; until then the descriptor
 * is not handed back to the DMA.
 *
 * The zero-copy half of the same split as emac_tx_buffer(): the selftest
 * verifies straight out of the DMA buffer. */
static const uint8_t *emac_rx_peek(uint32_t *len_out) {
    emac_desc_t *d = &g_rx_desc[g_rx_next];

    desc_from_dma(d);
    if (d->des0 & RDES0_OWN) return NULL;  /* nothing yet */

    uint32_t st = d->des0;
    uint32_t len = (st >> RDES0_FL_S) & RDES0_FL_M;

    /* RDES0's frame length counts the 4-byte FCS, because ACS is off and
     * would not have stripped it for an Ethernet II frame anyway (see
     * emac_start()). net/netif.h's contract is that what goes up carries no
     * FCS, so it comes off here -- unconditionally, since the MAC has already
     * checked it and a frame whose CRC failed never gets this far without
     * RDES0_ES set. */
    if (len >= 4u) len -= 4u;
    else st |= RDES0_ES;                   /* impossibly short; treat as error */

    if ((st & RDES0_ES) || !(st & RDES0_FS) || !(st & RDES0_LS)) {
        return NULL;                       /* errored or split across buffers */
    }

    /* The DMA wrote this buffer behind the cache's back, so drop any cached
     * copy before reading it. Without this the CPU can read a line that
     * predates the frame -- which, because the previous frame's bytes are
     * often still there, looks like the *last* frame arriving again rather
     * than like nothing arriving. */
    esp32p4_dcache_invalidate((uintptr_t)g_rx_buf[g_rx_next], EMAC_BUF_SIZE);
    *len_out = len;
    return g_rx_buf[g_rx_next];
}

/* Hands the current receive descriptor back to the DMA. Safe to call when
 * emac_rx_peek() returned NULL for an errored frame; that is how the ring
 * recovers. */
static void emac_rx_release(void) {
    emac_desc_t *d = &g_rx_desc[g_rx_next];
    esp32p4_dcache_invalidate((uintptr_t)g_rx_buf[g_rx_next], EMAC_BUF_SIZE);
    d->des0 = RDES0_OWN;
    desc_to_dma(d);
    g_rx_next = (g_rx_next + 1u) % EMAC_RX_DESC_COUNT;
    REG(EMAC_DMA_RXPOLL) = 1;
}


/* --- the Z2 selftest ----------------------------------------------------
 *
 * Sends frames through the MAC's internal loopback and checks that what comes
 * back is byte-identical. No PHY, no cable, no link -- which is the whole
 * point. A failure here has one candidate cause (the rings, the cache
 * discipline, or the buffer ownership protocol), where the same failure
 * attempted on a live wire would have four.
 *
 * The sizes are chosen to hit the edges the descriptor fields actually have:
 *
 *   60   the smallest legal Ethernet frame without FCS. Below 60 the MAC pads,
 *        which would make "what came back equals what went in" false for a
 *        reason that is not a bug.
 *   64   one whole cache line, so the buffer's tail is exactly a line boundary.
 *   65   one byte past a line, the case where a partial final line has to be
 *        maintained correctly.
 *   1514 NETIF_FRAME_MAX -- the largest frame this stack will ever hand down.
 */
static const uint16_t g_loopback_sizes[] = { 60, 64, 65, 128, 512, 1500, 1514 };

/* The expected byte at `off` in a frame of `len` bytes. A pure function, so
 * the test needs no copy of what it sent: the first six bytes are a
 * destination MAC, the next six a source MAC, then an EtherType, then a
 * pattern that depends on the length as well as the offset. */
static uint8_t loopback_byte(uint32_t off, uint32_t len) {
    static const uint8_t head[6] = { 0x02, 0x00, 0x00, 0x00, 0x00, 0x01 };
    if (off < 6u)  return head[off];
    if (off == 12u) return 0x08;
    if (off == 13u) return 0x00;
    return (uint8_t)(off + len);
}

void emac_loopback_test(void) {
    if (emac_probe() != 0) {
        cprintf("[EMAC] probe failed -- see `emac scan`.\n");
        return;
    }
    emac_start(true);

    cprintf("EMAC loopback: %u RX + %u TX descriptors of %u B, buffers %u B\n",
            (unsigned)EMAC_RX_DESC_COUNT, (unsigned)EMAC_TX_DESC_COUNT,
            (unsigned)sizeof(emac_desc_t), (unsigned)EMAC_BUF_SIZE);
    cprintf("  rings cost %u B of .bss; L1 line %u B (TRM 9.3.3.2 p909)\n",
            (unsigned)(sizeof(g_rx_desc) + sizeof(g_tx_desc) +
                       sizeof(g_rx_buf) + sizeof(g_tx_buf)),
            (unsigned)ESP32P4_L1_CACHE_LINE);

    unsigned passed = 0, failed = 0;

    for (unsigned s = 0; s < sizeof(g_loopback_sizes) / sizeof(g_loopback_sizes[0]); s++) {
        uint32_t len = g_loopback_sizes[s];

        /* Written straight into the DMA's transmit buffer, and checked
         * straight out of its receive buffer -- there is no second copy of
         * this frame anywhere, so the comparison cannot be satisfied by
         * comparing a buffer with itself. The expected bytes come from
         * loopback_byte(), a pure function of offset and length: a frame that
         * came back from the *previous* iteration (the classic stale-cache
         * symptom) has the wrong length baked into every byte and fails. */
        uint8_t *tx = emac_tx_buffer();
        if (!tx) {
            cprintf("  %4u B: no free transmit descriptor\n", (unsigned)len);
            failed++;
            continue;
        }
        for (uint32_t i = 0; i < len; i++) tx[i] = loopback_byte(i, len);

        int rc = emac_tx_submit(len);
        if (rc != 0) {
            cprintf("  %4u B: send refused (%d)\n", (unsigned)len, rc);
            failed++;
            continue;
        }

        /* Bounded wait. Loopback is a few microseconds; anything that has not
         * arrived in a millisecond is not going to. */
        const uint8_t *rx = NULL;
        uint32_t got = 0;
        for (unsigned i = 0; i < 1000u && rx == NULL; i++) {
            desc_from_dma(&g_rx_desc[g_rx_next]);
            if (!(g_rx_desc[g_rx_next].des0 & RDES0_OWN)) {
                rx = emac_rx_peek(&got);
                break;
            }
            time_delay_us(1);
        }

        if (!rx) {
            cprintf("  %4u B: nothing came back, DMA status 0x%08lx\n",
                    (unsigned)len, (unsigned long)REG(EMAC_DMA_STATUS));
            emac_rx_release();
            failed++;
            continue;
        }
        if (got != len) {
            cprintf("  %4u B: came back %u B\n", (unsigned)len, (unsigned)got);
            emac_rx_release();
            failed++;
            continue;
        }
        uint32_t bad = 0;
        for (uint32_t i = 0; i < len; i++) {
            if (rx[i] != loopback_byte(i, len)) bad++;
        }
        emac_rx_release();
        if (bad) {
            cprintf("  %4u B: %u byte%s differ\n", (unsigned)len,
                    (unsigned)bad, bad == 1 ? "" : "s");
            failed++;
            continue;
        }
        cprintf("  %4u B: ok\n", (unsigned)len);
        passed++;
    }

