domschl/LugalOS/drivers/emac_esp32p4.c
    /* Leave loopback off. A MAC left looped back would make Z3's link state
     * and Z4's first frame lie in a way that is very hard to see. */
    reg_modify(EMAC_MACCONFIG, MACCFG_LM, 0);

    cprintf("EMAC loopback: %u passed, %u failed\n", passed, failed);
}

/* ======================================================================
 * Z3 -- auto-negotiation and link state.
 * ====================================================================== */

/* Clause-22 registers. All standard, all in IEEE 802.3 clause 22.2.4 -- the
 * reason this driver needs no IP101-specific code at all, and why ESP-IDF
 * v6.1 no longer ships an esp_eth_phy_ip101.c. */
#define PHY_BMCR            0u
#define  BMCR_RESET             (1u << 15)
#define  BMCR_LOOPBACK          (1u << 14)
#define  BMCR_SPEED_100         (1u << 13)
#define  BMCR_AN_ENABLE         (1u << 12)
#define  BMCR_POWERDOWN         (1u << 11)
#define  BMCR_ISOLATE           (1u << 10)
#define  BMCR_AN_RESTART        (1u << 9)
#define  BMCR_FULL_DUPLEX       (1u << 8)
#define PHY_BMSR            1u
#define  BMSR_AN_COMPLETE       (1u << 5)
#define  BMSR_REMOTE_FAULT      (1u << 4)
#define  BMSR_AN_ABILITY        (1u << 3)
#define  BMSR_LINK_UP           (1u << 2)
#define PHY_ANAR            4u
#define PHY_ANLPAR          5u
#define  AN_100BASE_TX_FD       (1u << 8)
#define  AN_100BASE_TX_HD       (1u << 7)
#define  AN_10BASE_T_FD         (1u << 6)
#define  AN_10BASE_T_HD         (1u << 5)
#define  AN_SELECTOR_802_3      0x0001u

/* The RMII reference is always 50 MHz, and the MAC's RX/TX clock domain has
 * to be 25 MHz at 100 Mbit/s and 2.5 MHz at 10 Mbit/s. The field holds
 * (divider - 1), so:
 *
 *     100 Mbit/s   50/25  = 2   ->  DIV_NUM 1
 *      10 Mbit/s   50/2.5 = 20  ->  DIV_NUM 19
 *
 * DIV_NUM's reset value is 1, which is why Z1 could leave the divisors alone
 * and still have a working 100 Mbit/s link -- and why doing so was luck
 * dressed as a decision until this function existed. A 10 Mbit/s link with
 * the 100 Mbit/s divisor does not fail cleanly; it corrupts. */
#define EMAC_CLK_DIV_100M   1u
#define EMAC_CLK_DIV_10M    19u

static emac_link_t g_link;          /* last resolved state */
static uint64_t    g_link_checked_ms;
static bool        g_link_valid;

/* Applies a resolved speed and duplex to the MAC and to the RMII clock
 * divisors. Both halves matter and they live in different peripherals: the
 * MAC's own idea of the line rate is MACCONFIG.FES, and the clock that
 * actually shifts the bits is HP_SYS_CLKRST's. Setting one without the other
 * is the failure mode this function exists to make impossible. */
/* The station address the receive filter matches against.
 *
 * Kept in a static as well as written to the register because it has to be
 * written **again every time the link comes up** -- see the note in
 * emac_apply_link(). */
static uint8_t g_station_mac[NETIF_MAC_LEN];
static bool    g_station_mac_valid;

static void emac_set_mac(const uint8_t mac[NETIF_MAC_LEN]) {
    if (mac != g_station_mac) {
        memcpy(g_station_mac, mac, NETIF_MAC_LEN);
        g_station_mac_valid = true;
    }
    REG(EMAC_MACADDR0LOW)  = ((uint32_t)mac[3] << 24) | ((uint32_t)mac[2] << 16) |
                             ((uint32_t)mac[1] << 8)  |  (uint32_t)mac[0];
    REG(EMAC_MACADDR0HIGH) = ((uint32_t)mac[5] << 8)  |  (uint32_t)mac[4];
}

static void emac_apply_link(const emac_link_t *l) {
    uint32_t div = (l->speed_mbit == 10u) ? EMAC_CLK_DIV_10M : EMAC_CLK_DIV_100M;
    reg_modify(PERI_CLK_CTRL01, EMAC_RX_CLK_DIV_NUM_M, div);
    reg_modify(PERI_CLK_CTRL01, EMAC_TX_CLK_DIV_NUM_M,
               (div << EMAC_TX_CLK_DIV_NUM_S) & EMAC_TX_CLK_DIV_NUM_M);

    uint32_t cfg = REG(EMAC_MACCONFIG);
    cfg &= ~(MACCFG_FES | MACCFG_DM);
    if (l->speed_mbit == 100u) cfg |= MACCFG_FES;
    if (l->full_duplex)        cfg |= MACCFG_DM;
    REG(EMAC_MACCONFIG) = cfg;

    /* (The station address is re-applied by emac_link_poll(), not here: this
     * function only runs on a *change*, and the case that bit hardest was a
     * MAC reset with the link never appearing to change. See the long note
     * there.)
     *
     * Historical note kept because it explains the mechanism.
     *
     * Address0 is written once during bring-up, before auto-negotiation has
     * finished. At that point there is no link, so the RMII receive clock is
     * not running -- the divisors two lines above are what start it -- and
     * the address filter, which lives in that clock domain, never picks the
     * value up. The register itself takes the write: reading it back gives
     * exactly what was written, which is what makes this so slow to find.
     * The *filter* goes on comparing against its reset value, all ones.
     *
     * The symptom that produces is precise and misleading: broadcast frames
     * are accepted (ff:ff:ff:ff:ff:ff is a perfect match against a filter
     * still holding all ones), so ARP works, the link looks healthy, the peer
     * resolves us and caches our address -- and then every unicast frame
     * addressed to us is silently dropped. `emac stats` shows the right
     * address in the right register while nothing arrives.
     *
     * Re-applying it here fixes it for every link-up, not just the first, so
     * a replugged cable or a renegotiated speed cannot resurrect the problem.
     * Measured on the bench 2026-09-15: before this, ping was 0/4 with the
     * filter on and 4/4 with it off; after, 4/4 with the filter on. */
}

/* Starts auto-negotiation. Advertises everything this MAC can actually do --
 * 100 and 10, full and half -- rather than forcing a speed, because the
 * far end is not ours to assume. */
int emac_phy_autoneg_start(void) {
    int bmcr = emac_mdio_read(CONFIG_EMAC_PHY_ADDR, PHY_BMCR);
    if (bmcr < 0) return -1;

    /* Clear ISOLATE and POWERDOWN if a previous run or the straps left them
     * set: an isolated PHY answers MDIO perfectly and passes no traffic,
     * which is a memorably confusing state. */
    if (emac_mdio_write(CONFIG_EMAC_PHY_ADDR, PHY_BMCR,
                        (uint16_t)(bmcr & ~(BMCR_ISOLATE | BMCR_POWERDOWN |
                                            BMCR_LOOPBACK))) != 0) return -1;

    if (emac_mdio_write(CONFIG_EMAC_PHY_ADDR, PHY_ANAR,
                        AN_SELECTOR_802_3 | AN_100BASE_TX_FD | AN_100BASE_TX_HD |
                        AN_10BASE_T_FD | AN_10BASE_T_HD) != 0) return -1;

    if (emac_mdio_write(CONFIG_EMAC_PHY_ADDR, PHY_BMCR,
                        BMCR_AN_ENABLE | BMCR_AN_RESTART) != 0) return -1;
    g_link_valid = false;
    return 0;
}

/* Reads link state, resolves speed and duplex, and applies them if they
 * changed.
 *
 * Never blocks in the scheduler's sense: no task_block(), no lock, no wait on
 * another task. It does spin on the MDIO busy bit for a bounded few
 * microseconds, which is the same bounded spin every register access in this
 * kernel makes.
 *
 * Rate-limited, because netif_t's poll() is called in a tight loop and an
 * MDIO transaction per call would be a slow bus transaction per frame for no
 * information -- link state changes on human timescales. Between refreshes
 * the cached answer is returned. */
bool emac_link_poll(emac_link_t *out) {
    uint64_t now = time_get_ms();
    if (g_link_valid && (now - g_link_checked_ms) < 200u) {
        if (out) *out = g_link;
        return g_link.up;
    }
    g_link_checked_ms = now;

