domschl/LugalOS/drivers/emac_esp32p4.c
    /* BMSR's link bit latches low: it reports 0 if the link has been down at
     * any point since the last read, and the *current* state only on a second
     * read. One read would therefore report a link that has recovered as
     * still down, and would do so once per recovery -- an intermittent bug
     * with a latency of exactly one poll. Read twice, trust the second. */
    (void)emac_mdio_read(CONFIG_EMAC_PHY_ADDR, PHY_BMSR);
    int bmsr = emac_mdio_read(CONFIG_EMAC_PHY_ADDR, PHY_BMSR);

    emac_link_t l = { 0 };
    if (bmsr >= 0 && (bmsr & BMSR_LINK_UP)) {
        l.up = true;
        l.an_complete = (bmsr & BMSR_AN_COMPLETE) != 0;
        int anar = emac_mdio_read(CONFIG_EMAC_PHY_ADDR, PHY_ANAR);
        int lpar = emac_mdio_read(CONFIG_EMAC_PHY_ADDR, PHY_ANLPAR);
        if (l.an_complete && anar >= 0 && lpar >= 0) {
            /* The resolution is the intersection of what both ends
             * advertised, taken in the priority order 802.3 clause 28.1.4.5
             * defines: 100 full, 100 half, 10 full, 10 half. */
            uint32_t common = (uint32_t)anar & (uint32_t)lpar;
            if (common & AN_100BASE_TX_FD)      { l.speed_mbit = 100; l.full_duplex = true;  }
            else if (common & AN_100BASE_TX_HD) { l.speed_mbit = 100; l.full_duplex = false; }
            else if (common & AN_10BASE_T_FD)   { l.speed_mbit = 10;  l.full_duplex = true;  }
            else if (common & AN_10BASE_T_HD)   { l.speed_mbit = 10;  l.full_duplex = false; }
            else                                { l.speed_mbit = 10;  l.full_duplex = false; }
        } else {
            /* Link without a completed negotiation is parallel detect: the
             * far end is not negotiating, so 802.3 says assume half duplex at
             * whatever speed the PHY managed. Reported honestly rather than
             * papered over -- it is also exactly what the laptop's e1000e
             * prints for a moment each time this board resets. */
            l.speed_mbit = 10;
            l.full_duplex = false;
        }
    }

    bool changed = !g_link_valid ||
                   l.up != g_link.up ||
                   l.speed_mbit != g_link.speed_mbit ||
                   l.full_duplex != g_link.full_duplex;
    g_link = l;
    g_link_valid = true;
    if (changed && l.up) emac_apply_link(&l);

    /* Re-apply the station address to the receive filter on every poll that
     * sees the link up. Two register writes per poll, and the poll above is
     * rate-limited to one MDIO exchange per 200 ms, so the cost is nil.
     *
     * Unconditional, and that is the point. The filter only latches Address0
     * while the RMII receive clock runs -- i.e. while the link is up -- so a
     * write made at any other time reads back byte-perfect and never reaches
     * the filter, which goes on comparing against its all-ones reset value.
     * Broadcast then passes, ARP works, the peer caches our address, and
     * every unicast frame to us is dropped: see the long note in
     * emac_apply_link() for the full symptom.
     *
     * Three narrower versions were tried, and each one looked right and
     * failed on hardware. They are listed because every one of them is the
     * obvious thing to try again:
     *
     *   - in emac_apply_link(), i.e. on a link *change*. Wrong because the
     *     worst case has no change at all -- `emac link` re-probes, the probe
     *     resets the MAC and wipes Address0, the cable never moved, so the
     *     next poll sees the same speed and duplex and nothing is rewritten.
     *   - once per link-up, keyed on a flag emac_start() cleared. Wrong
     *     because the one write it makes happens on the first poll that sees
     *     the link up, which is exactly when the receive clock has just
     *     started and has not settled. The write does not latch, the flag
     *     says it did, and it is never retried.
     *   - unconditionally, here, but left to whoever happened to call this
     *     function. Wrong because after the interface has come up once, that
     *     is nobody: net/stack.c asks netif_link_up() only until it first
     *     answers yes. Which is why emac_netif_poll() now drives this --
     *     poll() is the only callback the stack keeps calling.
     *
     * Retrying forever is immune to all three: a write that does not take is
     * simply followed by another one 200 ms later. */
    if (l.up && g_station_mac_valid) emac_set_mac(g_station_mac);

    if (out) *out = l;
    return l.up;
}

void emac_link_report(void) {
    if (emac_probe() != 0) {
        cprintf("[EMAC] probe failed -- see `emac scan`.\n");
        return;
    }
    emac_start(false);
    if (emac_phy_autoneg_start() != 0) {
        cprintf("[EMAC] could not start auto-negotiation (PHY at %d not "
                "answering?)\n", (int)CONFIG_EMAC_PHY_ADDR);
        return;
    }

    cprintf("EMAC: negotiating...\n");
    emac_link_t l = { 0 };
    /* Auto-negotiation is a few hundred milliseconds when the far end is
     * ready and forever when the cable is out, so this is bounded and the
     * bound is part of the answer. */
    for (unsigned i = 0; i < 40u; i++) {
        g_link_valid = false;           /* defeat the rate limit while waiting */
        if (emac_link_poll(&l) && l.an_complete) break;
        time_delay_us(100000);
    }

    if (!l.up) {
        cprintf("EMAC: link DOWN (no carrier)\n");
        return;
    }
    cprintf("EMAC: link UP, %u Mbit/s %s duplex%s, MACCONFIG 0x%08lx\n",
            (unsigned)l.speed_mbit, l.full_duplex ? "full" : "half",
            l.an_complete ? "" : " (parallel detect)",
            (unsigned long)REG(EMAC_MACCONFIG));
}

/* --- Z3's other half: does link-down actually get noticed? ---------------
 *
 * "It reports the link is up" is the easy half, and a driver that returned a
 * hardcoded `true` would pass it. The half that matters for netif_t is that
 * link_up() goes false when the carrier goes away, promptly, without
 * spinning, and comes back when it returns.
 *
 * Testing that normally means a human unplugging a cable, which cannot live
 * in a test suite. So it is done from the PHY's side instead: BMCR's
 * POWERDOWN bit drops the link exactly as pulling the cable does -- BMSR's
 * link bit clears either way, which is all the MAC and this driver can see.
 * The cable stays in and the far end notices a real carrier loss, which is
 * also a useful check that this board is visible to the switch it is plugged
 * into.
 *
 * Latency is measured rather than assumed, because the rate limit in
 * emac_link_poll() puts a floor under it and a floor that drifts is worth
 * catching. */
void emac_link_updown_test(void) {
    if (emac_probe() != 0) {
        cprintf("[EMAC] probe failed -- see `emac scan`.\n");
        return;
    }
    emac_start(false);
    if (emac_phy_autoneg_start() != 0) {
        cprintf("[EMAC] auto-negotiation would not start.\n");
        return;
    }

    emac_link_t l;
    for (unsigned i = 0; i < 40u && !(emac_link_poll(&l) && l.an_complete); i++) {
        g_link_valid = false;
        time_delay_us(100000);
    }
    if (!l.up) {
        cprintf("EMAC linktest: SKIPPED -- no carrier to begin with.\n");
        return;
    }
    cprintf("EMAC linktest: up at %u Mbit/s %s duplex; dropping the PHY...\n",
            (unsigned)l.speed_mbit, l.full_duplex ? "full" : "half");

    /* Down. */
    int bmcr = emac_mdio_read(CONFIG_EMAC_PHY_ADDR, PHY_BMCR);
    emac_mdio_write(CONFIG_EMAC_PHY_ADDR, PHY_BMCR,
                    (uint16_t)(bmcr | BMCR_POWERDOWN));

    uint64_t t0 = time_get_ms();
    bool went_down = false;
    for (unsigned i = 0; i < 300u; i++) {
        if (!emac_link_poll(&l)) { went_down = true; break; }
        time_delay_us(10000);
    }
    uint64_t down_ms = time_get_ms() - t0;

