domschl/LugalOS/drivers/emac_esp32p4.c
    /* Back up, whatever happened above -- leaving the PHY powered down would
     * be a far worse failure than the one being tested for. */
    emac_mdio_write(CONFIG_EMAC_PHY_ADDR, PHY_BMCR,
                    (uint16_t)(bmcr & ~BMCR_POWERDOWN));
    emac_phy_autoneg_start();

    t0 = time_get_ms();
    bool came_back = false;
    for (unsigned i = 0; i < 100u; i++) {
        g_link_valid = false;
        if (emac_link_poll(&l) && l.an_complete) { came_back = true; break; }
        time_delay_us(100000);
    }
    uint64_t up_ms = time_get_ms() - t0;

    if (!went_down) {
        cprintf("EMAC linktest: FAILED -- link never went down with the PHY "
                "powered off.\n");
        return;
    }
    if (!came_back) {
        cprintf("EMAC linktest: FAILED -- link did not come back (down was "
                "noticed in %u ms).\n", (unsigned)down_ms);
        return;
    }
    cprintf("EMAC linktest: down noticed in %u ms, back up in %u ms "
            "at %u Mbit/s %s duplex\n",
            (unsigned)down_ms, (unsigned)up_ms, (unsigned)l.speed_mbit,
            l.full_duplex ? "full" : "half");
    cprintf("EMAC linktest: PASSED\n");
}

/* --- Z4: the netif ------------------------------------------------------
 *
 * Everything below turns the three primitives Z2 proved -- emac_tx_buffer() /
 * emac_tx_submit(), emac_rx_peek() / emac_rx_release() -- into the shape
 * net/netif.h specifies, and points them at the real PHY instead of the MAC's
 * internal loopback.
 *
 * The FCS is not handled here. emac_rx_peek() already strips it (and explains
 * at length why ACS cannot), so what this layer hands up carries no FCS, as
 * netif.h requires. The *check* is the MAC's: a frame whose CRC failed sets
 * RDES0_ES and emac_rx_peek() never returns it.
 *
 * Destination filtering is likewise not a memcmp() here -- emac_start() puts
 * it in the address filter, where the hardware compares every arriving frame
 * against Address0 for free. A frame that is neither ours nor broadcast is
 * dropped before it ever occupies a descriptor.
 */

static netif_t g_netif;
static bool    g_netif_registered;

/* The zero-copy hand-off between poll() and recv_frame().
 *
 * poll() peeks at the head descriptor and *holds* it -- the bytes stay in the
 * DMA buffer, and nothing is copied until recv_frame() asks for them. The
 * ENC28J60 driver latches into a private 1514-byte buffer instead; it has to,
 * because its frame lives behind an SPI bus rather than in memory the CPU can
 * address. Here the buffer already is memory, so the copy would be pure cost.
 *
 * The obligation that comes with holding a descriptor is that it has to be
 * released on *every* path out, including the ones that are not a successful
 * receive -- a frame too big for the caller's buffer, or a caller that polls
 * and never receives. Miss one and the ring stops at that descriptor
 * permanently, which presents as "the link is up and no traffic arrives".
 * g_rx_held is what makes that auditable. */
static const uint8_t *g_rx_held;
static uint32_t       g_rx_held_len;

/* Frames dropped with RDES0_ES set, or split across descriptors. Counted
 * here and not in netif_t: net/netif.h reserves its counters for what the
 * netif_send()/netif_recv() wrappers can see, precisely so two drivers cannot
 * disagree about what they mean. A hardware-level error is this driver's own
 * business, and its own number. */
static uint32_t g_rx_hw_errors;

/* The Ethernet header of the last frame the MAC accepted, so `emac stats` can
 * answer "what is actually addressed to us on this wire" without a capture
 * host. Fourteen bytes: destination, source, EtherType. */
static uint8_t  g_last_hdr[14];
static bool     g_last_hdr_valid;

static int emac_netif_poll(netif_t *nif) {
    (void)nif;
    if (!g_netif_registered) return -1;

    /* Pump the link, which also rewrites the station address into the receive
     * filter (see emac_link_poll()). Rate-limited inside emac_link_poll() to
     * one MDIO exchange per 200 ms, so calling it from this hot path costs
     * nothing in the common case.
     *
     * It has to be driven from *here*, and that is the whole point. The
     * obvious homes for it are all functions nobody calls often enough:
     * net/stack.c asks netif_link_up() only until the first time it answers
     * yes (net_autoconfig_once() latches `done`), so after the interface has
     * come up once, the only thing that ever calls emac_link_poll() again is
     * a human typing `net` or `emac link`. Anything that resets the MAC after
     * that point -- `emac link` itself does, via emac_probe() -- would wipe
     * Address0 out of the filter with nothing left running to put it back,
     * and the board would answer ARP and drop every unicast frame until the
     * next reboot. poll() is the one call that keeps coming. */
    (void)emac_link_poll(NULL);

    if (g_rx_held) return 1;            /* already holding one; idempotent */

    /* Bounded, because a burst of errored frames must not turn a poll into an
     * unbounded loop -- netif_t's poll() is called from tight loops and is
     * required never to block. One pass over the ring is the natural bound:
     * anything still queued is picked up by the next poll. */
    for (unsigned i = 0; i < EMAC_RX_DESC_COUNT; i++) {
        uint32_t len = 0;
        const uint8_t *p = emac_rx_peek(&len);
        if (p) {
            if (len > NETIF_FRAME_MAX) {
                /* Longer than anything this stack can carry. The receive
                 * watchdog already cuts frames above 2048 bytes, so this is
                 * the band between 1514 and that -- a jumbo frame from a
                 * misconfigured peer, not a hardware fault. */
                g_rx_hw_errors++;
                emac_rx_release();
                continue;
            }
            if (len >= sizeof(g_last_hdr)) {
                memcpy(g_last_hdr, p, sizeof(g_last_hdr));
                g_last_hdr_valid = true;
            }
            g_rx_held = p;
            g_rx_held_len = len;
            return 1;
        }
        /* NULL means either "nothing yet" or "an errored frame is sitting at
         * the head". They are distinguished by ownership: if the DMA still
         * owns the descriptor there is genuinely nothing there, and releasing
         * it would hand the DMA a descriptor it already has. */
        emac_desc_t *d = &g_rx_desc[g_rx_next];
        desc_from_dma(d);
        if (d->des0 & RDES0_OWN) return 0;      /* empty ring; done */
        g_rx_hw_errors++;
        emac_rx_release();                       /* drop it and look again */
    }
    return 0;
}

static int emac_netif_recv_frame(netif_t *nif, uint8_t *buf, uint32_t max_len) {
    (void)nif;
    if (!g_rx_held || !buf) return -1;
    if (g_rx_held_len > max_len) {
        /* Does not fit. Release anyway -- see g_rx_held's comment; a frame we
         * refuse must not become a frame that stops the ring. */
        g_rx_hw_errors++;
        g_rx_held = NULL;
        g_rx_held_len = 0;
        emac_rx_release();
        return -1;
    }
    uint32_t n = g_rx_held_len;
    memcpy(buf, g_rx_held, n);
    g_rx_held = NULL;
    g_rx_held_len = 0;
    emac_rx_release();
    return (int)n;
}

