domschl/LugalOS/drivers/emac_esp32p4.c
static int emac_netif_send_frame(netif_t *nif, const uint8_t *buf, uint32_t len) {
    (void)nif;
    if (!g_netif_registered || !buf) return -1;
    if (len == 0 || len > NETIF_FRAME_MAX) return -1;

    /* Frames shorter than 60 bytes are NOT rejected and NOT padded here: the
     * MAC pads to the 60-byte minimum itself and appends the FCS, which is
     * the same division of labour the FCS has on the way in. Padding in
     * software would send the wire a frame with our own zeros in it and hide
     * whether the hardware was doing its job. */

    /* Wait for the DMA to release the descriptor. Bounded, and the bound is
     * generous by design: at 100 Mbit/s a full 1514-byte frame is ~121 us on
     * the wire, so 10 ms is roughly eighty frame times -- long enough that
     * hitting it means the DMA is wedged rather than busy. netif.h permits
     * blocking "for as long as the hardware needs to accept the buffer", and
     * this is that, with a ceiling. */
    uint8_t *dst = NULL;
    for (unsigned i = 0; i < 1000u; i++) {
        dst = emac_tx_buffer();
        if (dst) break;
        time_delay_us(10);
    }
    if (!dst) return -1;

    memcpy(dst, buf, len);
    if (emac_tx_submit(len) != 0) return -1;
    return (int)len;
}

static bool emac_netif_link_up(netif_t *nif) {
    (void)nif;
    if (!g_netif_registered) return false;
    emac_link_t l = { 0 };
    return emac_link_poll(&l);
}

int emac_netif_init(void) {
    if (g_netif_registered) return 0;       /* idempotent, like emac_probe() */

    int rc = emac_probe();
    if (rc != 0) {
        printk("[EMAC] probe failed (%d) -- no interface registered; try `emac scan`\n", rc);
        return -1;
    }

    memset(&g_netif, 0, sizeof(g_netif));
    g_netif.name       = "eth0";
    g_netif.poll       = emac_netif_poll;
    g_netif.send_frame = emac_netif_send_frame;
    g_netif.recv_frame = emac_netif_recv_frame;
    g_netif.link_up    = emac_netif_link_up;

    /* .mac is left zeroed deliberately: this MAC has no address of its own
     * (there is no EEPROM on the RMII side and the eFuse MAC belongs to the
     * radio), so netif_register() fills it from the node identity -- exactly
     * the case its comment describes. Same as the ENC28J60. */
    if (netif_register(&g_netif) != 0) {
        printk("[EMAC] netif_register() failed -- no free interface slot\n");
        return -1;
    }
    g_netif_registered = true;

    /* This write is not what makes the filter work -- emac_link_poll() is,
     * on every poll that sees the link up, and the long comment there says
     * why. It is done here anyway so g_station_mac is populated before
     * anything can poll, and so the register holds the right value from the
     * first instant rather than the all-ones the probe's reset left.
     *
     * Do not be tempted to "simplify" this by trusting it: a readback here
     * succeeds whether or not the filter ever saw the address, which is
     * precisely what made this bug take an afternoon. `emac stats` is the
     * honest diagnostic, and a ping is the only real test. */
    emac_set_mac(g_netif.mac);
    emac_start(false);

    if (emac_phy_autoneg_start() != 0) {
        printk("[EMAC] auto-negotiation did not start (PHY at %d not answering)\n",
               (int)CONFIG_EMAC_PHY_ADDR);
        /* Not fatal: the interface stays registered and link_up() will keep
         * reporting false, which is the honest answer and the one net/stack.c
         * already knows how to wait on. */
    }

    char macstr[18];
    netif_mac_str(g_netif.mac, macstr);
    emac_link_t l = { 0 };
    bool up = emac_link_poll(&l);
    printk("[EMAC] eth0 registered, mac %s, link %s\n", macstr,
           up ? "UP" : "negotiating");
    return 0;
}

netif_t *emac_get_netif(void) {
    return g_netif_registered ? &g_netif : NULL;
}

/* --- Z4 diagnostics ------------------------------------------------------
 *
 * `emac stats`. A netif that is up and silent has several possible causes
 * that look identical from the outside -- the address filter rejecting
 * everything, the DMA running out of descriptors, the FIFO overflowing, the
 * PHY having renegotiated to something the MAC is not set to -- and this
 * prints the register that distinguishes each. Written when unicast frames
 * were not arriving while broadcast was, which is exactly the case where
 * "the link is up" tells you nothing.
 */
void emac_stats_report(void) {
    if (!g_netif_registered) {
        cprintf("EMAC: no interface registered (`emac link` for the PHY).\n");
        return;
    }
    uint32_t lo = REG(EMAC_MACADDR0LOW), hi = REG(EMAC_MACADDR0HIGH);
    uint32_t missed = REG(EMAC_DMA_MISSEDFRAME);
    char macstr[18];
    netif_mac_str(g_netif.mac, macstr);

    cprintf("EMAC %s: mac %s\n", g_netif.name, macstr);
    cprintf("  filter   0x%08lx  %s\n", (unsigned long)REG(EMAC_MACFRAMEFILTER),
            (REG(EMAC_MACFRAMEFILTER) & FILTER_RA) ? "PROMISCUOUS (receive all)"
                                                   : "our unicast + broadcast");
    cprintf("  addr0    hi 0x%08lx lo 0x%08lx -> %02x:%02x:%02x:%02x:%02x:%02x\n",
            (unsigned long)hi, (unsigned long)lo,
            (unsigned)(lo & 0xff), (unsigned)((lo >> 8) & 0xff),
            (unsigned)((lo >> 16) & 0xff), (unsigned)((lo >> 24) & 0xff),
            (unsigned)(hi & 0xff), (unsigned)((hi >> 8) & 0xff));
    cprintf("  maccfg   0x%08lx   dma status 0x%08lx   opmode 0x%08lx\n",
            (unsigned long)REG(EMAC_MACCONFIG), (unsigned long)REG(EMAC_DMA_STATUS),
            (unsigned long)REG(EMAC_DMA_OPMODE));
    cprintf("  missed   %lu no-descriptor, %lu fifo-overflow%s\n",
            (unsigned long)(missed & 0xffffu), (unsigned long)((missed >> 17) & 0x7ffu),
            (missed & (1u << 16)) ? " (counter wrapped)" : "");
    cprintf("  rx       %lu frames, %lu bytes, %lu hardware errors/oversize\n",
            (unsigned long)g_netif.rx_frames, (unsigned long)g_netif.rx_bytes,
            (unsigned long)g_rx_hw_errors);
    cprintf("  tx       %lu frames, %lu bytes, %lu errors\n",
            (unsigned long)g_netif.tx_frames, (unsigned long)g_netif.tx_bytes,
            (unsigned long)g_netif.tx_errors);
    if (g_last_hdr_valid) {
        cprintf("  last rx  dst %02x:%02x:%02x:%02x:%02x:%02x  src "
                "%02x:%02x:%02x:%02x:%02x:%02x  type 0x%02x%02x\n",
                g_last_hdr[0], g_last_hdr[1], g_last_hdr[2],
                g_last_hdr[3], g_last_hdr[4], g_last_hdr[5],
                g_last_hdr[6], g_last_hdr[7], g_last_hdr[8],
                g_last_hdr[9], g_last_hdr[10], g_last_hdr[11],
                g_last_hdr[12], g_last_hdr[13]);
    } else {
        cprintf("  last rx  (nothing received yet)\n");
    }
}

/* `emac promisc on|off`. Turning the address filter off is the one
 * measurement that separates "the wire is quiet" from "we are refusing what
 * is on it": if traffic appears the moment filtering stops, the frames were
 * always arriving and the filter was rejecting them. Left as a command
 * rather than a build option because the question recurs on every new
 * network this board is plugged into. */
void emac_set_promiscuous(bool on) {
    if (!g_netif_registered) {
        cprintf("EMAC: no interface registered.\n");
        return;
    }
    REG(EMAC_MACFRAMEFILTER) = on ? FILTER_RA : 0u;
    cprintf("EMAC: receive filter %s (0x%08lx)\n",
            on ? "OFF -- accepting every frame on the wire"
               : "on -- our unicast and broadcast only",
            (unsigned long)REG(EMAC_MACFRAMEFILTER));
}

/* Called from emac_start(), i.e. every time the rings are reinitialised.
 * Separate from the statics it touches only because emac_start() is defined
 * long before the netif is. The station address needs nothing here: it is
 * rewritten by every link-up poll regardless. */
static void emac_netif_restarted(void) {
    g_rx_held = NULL;
    g_rx_held_len = 0;
}
